In [1]:
import pandas as pd
df = pd.read_csv('associado.csv')

In [3]:
import sqlite3
# Create your connection.
cnx = sqlite3.connect('associado.db')

In [4]:
df.to_sql('associado', index=False, con=cnx)

199

In [40]:
d = pd.read_xml('data/conta.xml')
d[d['id'].isna()]

Empty DataFrame
Columns: [id, tipo, data_criacao, id_associado]
Index: []

In [6]:
pd.read_sql('select * from associado', con=cnx)

      id        nome     sobrenome  idade                 email
0      1    cliente1    sobrenome1     22    cliente1@email.com
1      2    cliente2    sobrenome2     41    cliente2@email.com
2      3    cliente3    sobrenome3     80    cliente3@email.com
3      4    cliente4    sobrenome4     48    cliente4@email.com
4      5    cliente5    sobrenome5     20    cliente5@email.com
..   ...         ...           ...    ...                   ...
194  195  cliente195  sobrenome195     39  cliente195@email.com
195  196  cliente196  sobrenome196     52  cliente196@email.com
196  197  cliente197  sobrenome197     28  cliente197@email.com
197  198  cliente198  sobrenome198     22  cliente198@email.com
198  199  cliente199  sobrenome199     57  cliente199@email.com

[199 rows x 5 columns]

In [13]:
df = pd.read_csv('cartao.csv')

In [14]:
df

      id   num_cartao  nom_impresso  id_conta  id_associado
0      1  45362117086           NaN        33           103
1      2  71600523487           NaN       160           101
2      3  46016682819           NaN       155            60
3      4  67015736695           NaN       213           190
4      5  81192832431           NaN        40           114
..   ...          ...           ...       ...           ...
283  284  73021062041           NaN        75            70
284  285  54150460402           NaN       185           176
285  286  64494953936           NaN        29            38
286  287  73731978965           NaN       244             1
287  288  47887195670           NaN       177           149

[288 rows x 5 columns]

In [18]:
df['nom_impresso'] = 'cliente' + df['id_associado'].astype(str)

In [15]:
import numpy as np
# Definir o intervalo de datas
data_inicio = '2024-01-01'
data_fim = '2024-07-31'

# Gerar timestamps aleatórios
num_registros = 288  # Quantidade de timestamps desejada

# Converter para datetime64[ns]
start = pd.to_datetime(data_inicio)
end = pd.to_datetime(data_fim)

# Gerar timestamps aleatórios usando numpy
random_timestamps = pd.to_datetime(
    np.random.randint(
        start.value,  # Valor em nanossegundos
        end.value, 
        size=num_registros
    )
)

# Criar DataFrame
random_timestamps

# Formatar a exibição (opcional)
#df['timestamp_aleatorio'] = df['timestamp_aleatorio'].dt.strftime('%Y-%m-%d %H:%M:%S')

DatetimeIndex(['2024-02-21 00:32:13.791997914',
               '2024-06-04 04:47:17.754766557',
               '2024-05-29 03:18:51.676915375',
               '2024-01-23 04:23:27.469614399',
               '2024-04-10 01:29:02.164619902',
               '2024-05-16 02:16:08.628191751',
               '2024-04-28 09:24:13.372573233',
               '2024-05-23 07:25:49.797663447',
               '2024-01-23 21:50:36.925584433',
               '2024-03-30 22:37:57.294672656',
               ...
               '2024-03-11 01:59:44.134033051',
               '2024-03-14 00:41:59.436295898',
               '2024-04-22 13:51:43.324562987',
               '2024-03-02 04:10:48.215906393',
               '2024-02-06 14:19:00.537439974',
               '2024-05-23 07:12:28.783104754',
               '2024-01-30 11:02:21.168963521',
               '2024-06-14 19:24:05.429246984',
               '2024-03-27 13:58:41.096495695',
               '2024-04-09 19:56:49.280835156'],
              dtype='datetime64[ns]', length=288, freq=None)

In [16]:
df['data_criacao'] = random_timestamps
df['data_criacao'] = df['data_criacao'].dt.strftime('%Y-%m-%d %H:%M:%S')

In [19]:
df.to_json('cartao.json',index=False)

In [21]:
import pandas as pd
df = pd.read_csv('conta.csv')

In [24]:
df['data_criacao'] = pd.to_datetime(df['data_criacao'])

/var/folders/8r/9lkd9b_s76n56hpgsm3jgm7c0000gn/T/ipykernel_70428/1273587469.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['data_criacao'] = pd.to_datetime(df['data_criacao'])

In [25]:
df.to_xml('conta.xml',index=False)

In [42]:
df = pd.read_json('data/cartao.json')

In [45]:
df.to_json('data/cartao.json', orient='records', indent=4,index=False)

In [57]:
df=pd.read_parquet('data/movimento.parquet')

In [56]:
df.to_parquet('data/movimento.parquet',index=False)

In [50]:
df['id'] = df['id'].astype(int)

      id  vlr_transacao des_transacao       data_movimento  id_cartao
0      1            145        desc 1  04/01/2025 00:00:00        182
1      2             68        desc 2  17/02/2025 00:00:00        159
2      3            162        desc 3  09/02/2025 00:00:00        239
3      4            196        desc 4  10/01/2025 00:00:00         26
4      5            105        desc 1  08/01/2025 00:00:00        173
..   ...            ...           ...                  ...        ...
994  995            153        desc 5  30/01/2025 00:00:00        200
995  996             42        desc 5  08/02/2025 00:00:00        189
996  997             42        desc 5  22/02/2025 00:00:00        217
997  998            124        desc 5  05/01/2025 00:00:00        182
998  999            154        desc 5  11/02/2025 00:00:00        186

[999 rows x 5 columns]

In [53]:
df['vlr_transacao']=df['vlr_transacao'].astype(float)

In [55]:
df['id_cartao']=df['id_cartao'].astype(int)

In [61]:
import polars as pl
pl.read_parquet('data/movimento.parquet')

shape: (999, 5)
┌─────┬───────────────┬───────────────┬─────────────────────┬───────────┐
│ id  ┆ vlr_transacao ┆ des_transacao ┆ data_movimento      ┆ id_cartao │
│ --- ┆ ---           ┆ ---           ┆ ---                 ┆ ---       │
│ i64 ┆ f64           ┆ str           ┆ str                 ┆ i64       │
╞═════╪═══════════════╪═══════════════╪═════════════════════╪═══════════╡
│ 1   ┆ 145.0         ┆ desc 1        ┆ 04/01/2025 00:00:00 ┆ 182       │
│ 2   ┆ 68.0          ┆ desc 2        ┆ 17/02/2025 00:00:00 ┆ 159       │
│ 3   ┆ 162.0         ┆ desc 3        ┆ 09/02/2025 00:00:00 ┆ 239       │
│ 4   ┆ 196.0         ┆ desc 4        ┆ 10/01/2025 00:00:00 ┆ 26        │
│ 5   ┆ 105.0         ┆ desc 1        ┆ 08/01/2025 00:00:00 ┆ 173       │
│ …   ┆ …             ┆ …             ┆ …                   ┆ …         │
│ 995 ┆ 153.0         ┆ desc 5        ┆ 30/01/2025 00:00:00 ┆ 200       │
│ 996 ┆ 42.0          ┆ desc 5        ┆ 08/02/2025 00:00:00 ┆ 189       │
│ 997 ┆ 42.0          ┆ desc 5        ┆ 22/02/2025 00:00:00 ┆ 217       │
│ 998 ┆ 124.0         ┆ desc 5        ┆ 05/01/2025 00:00:00 ┆ 182       │
│ 999 ┆ 154.0         ┆ desc 5        ┆ 11/02/2025 00:00:00 ┆ 186       │
└─────┴───────────────┴───────────────┴─────────────────────┴───────────┘

In [65]:
df = pd.read_csv('data/associado.csv')

In [ ]:
pd.read_xml('data/conta.xml')

In [36]:
import pandas as pd
with open("data/conta.xml", "r", encoding="utf-8") as f:
    first_lines = f.readlines()[:5]  # Lê as primeiras 5 linhas
    for line in first_lines:
        print(repr(line))  # Mostra caracteres ocultos

"<?xml version='1.0' encoding='utf-8'?>\n"
'<data>\n'
'  <row>\n'
'    <id>1</id>\n'
'    <tipo>empresarial</tipo>\n'

In [26]:
import psycopg2

# Conexão ao postgresql:
conn = psycopg2.connect(
    dbname="si_cooperative_cartoes",
    user="admin",
    password="admin",
    host="localhost"
)
cur = conn.cursor()
cur.execute("select * from bronze.movimento_staging;")

In [27]:
cur.fetchall()

[]